# Week 02 Project: Data Cleaning and Preprocessing

 
Topics: 
1) Understanding messy data and the need for data cleaning 
2) Handling missing values, duplicates, and outliers 
3) Data transformation: normalization and standardization 
4) Using Pandas and NumPy for data preprocessing 
5) Introduction to Regular Expressions for text cleaning 
Python Project: "Data Cleaning Challenge" â€“ Given a messy dataset, clean it by: Removing missing values Standardizing formats Identifying and handling outliers Dataset: Attached is a csv file with missing values and inconsistent formats

## Importing Requirements and Getting the Data

In [33]:
import pandas as pd
import numpy as np

In [56]:
messy_data = pd.read_csv('https://raw.githubusercontent.com/Impact-Insights/Group-Project/refs/heads/main/DMD%20Data%20Group%201%20W_02%20Submission/messy_dataset.csv?token=GHSAT0AAAAAAC7CHSQI7SLRJQ2CP4UEMCYAZ5VTSEQ')

## Performing Exploratory Data Analysis (EDA) on the Data

In [57]:
messy_data

,ID,Name,Age,Email,Salary ($),Joining Date,Department
0,40,Eve,23.0,eve@ex.co,65000,02/10/2023,HR
1,26,Alice,31.0,alice@example.com,"50,000",2022-01-15,HR
2,27,Bob,24.0,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
3,4,David,22.0,david@example,50000,2021-07-10,Finance
4,36,Alice,26.0,alice@example.com,"50,000",2022-01-15,HR
5,2,Bob,NaN,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
6,5,Eve,27.0,eve@ex.co,65000,02/10/2023,HR
7,13,Charlie,NaN,charlie@example.com,60000$,"March 3, 2020",Marketing
8,9,David,23.0,david@example,50000,2021-07-10,Finance
9,4,David,22.0,david@example,50000,2021-07-10,Finance
10,7,Bob,29.0,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
11,25,Eve,23.0,eve@ex.co,65000,02/10/2023,HR
12,33,Charlie,22.0,charlie@example.com,60000$,"March 3, 2020",Marketing
13,20,Eve,25.0,eve@ex.co,65000,02/10/2023,HR
14,18,Charlie,22.0,charlie@example.com,60000$,"March 3, 2020",Marketing
15,14,David,21.0,david@example,50000,2021-07-10,Finance
16,3,Charlie,30.0,charlie@example.com,60000$,"March 3, 2020",Marketing
17,16,Alice,27.0,alice@example.com,"50,000",2022-01-15,HR
18,10,Eve,31.0,eve@ex.co,65000,02/10/2023,HR
19,17,Bob,NaN,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
20,38,Charlie,29.0,charlie@example.com,60000$,"March 3, 2020",Marketing
21,32,Bob,NaN,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
22,28,Charlie,28.0,charlie@example.com,60000$,"March 3, 2020",Marketing
23,1,Alice,25.0,alice@example.com,"50,000",2022-01-15,HR
24,31,Alice,27.0,alice@example.com,"50,000",2022-01-15,HR
25,30,Eve,21.0,eve@ex.co,65000,02/10/2023,HR
26,6,Alice,26.0,alice@example.com,"50,000",2022-01-15,HR
27,12,Bob,28.0,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
28,34,David,30.0,david@example,50000,2021-07-10,Finance
29,2,Bob,NaN,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
30,1,Alice,25.0,alice@example.com,"50,000",2022-01-15,HR
31,22,Bob,24.0,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
32,3,Charlie,30.0,charlie@example.com,60000$,"March 3, 2020",Marketing
33,35,Eve,25.0,eve@ex.co,65000,02/10/2023,HR
34,24,David,NaN,david@example,50000,2021-07-10,Finance
35,37,Bob,24.0,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
36,11,Alice,24.0,alice@example.com,"50,000",2022-01-15,HR
37,23,Charlie,29.0,charlie@example.com,60000$,"March 3, 2020",Marketing
38,19,David,30.0,david@example,50000,2021-07-10,Finance
39,5,Eve,27.0,eve@ex.co,65000,02/10/2023,HR
40,21,Alice,26.0,alice@example.com,"50,000",2022-01-15,HR
41,8,Charlie,NaN,charlie@example.com,60000$,"March 3, 2020",Marketing
42,15,Eve,26.0,eve@ex.co,65000,02/10/2023,HR
43,29,David,NaN,david@example,50000,2021-07-10,Finance
44,39,David,NaN,david@example,50000,2021-07-10,Finance

In [36]:
messy_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45 entries, 0 to 44
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            45 non-null     int64
 1   Name          45 non-null     object
 2   Age           36 non-null     float64
 3   Email         45 non-null     object
 4   Salary ($)    45 non-null     object
 5   Joining Date  45 non-null     object
 6   Department    45 non-null     object
dtypes: float64(1), int64(1), object(5)
memory usage: 2.6+ KB

In [37]:
messy_data.describe()

              ID        Age
count  45.000000  36.000000
mean   18.555556  25.888889
std    12.340907   2.993114
min     1.000000  21.000000
25%     7.000000  23.750000
50%    18.000000  26.000000
75%    29.000000  28.250000
max    40.000000  31.000000

From the information provided above we can immediately notice that there are some issues that can be fixed:

1. We can change the `ID` column data format to be an `object` as we are not going to perform any calculations on it.
2. We can notice that there are 7 missing values in the `Age` column because it counts that there are 36 non-null values while there should be 45 and the data format can be changed to an integer as age is recorded as a whole number and we can perform calculations on it.
- We can fill the NaN values in the `Age` column by the column mean which is more suitable as the data indicates that most of the people are in the same age group. 
3. The `Salary` column can be changed to be of currency data format or just a number as we can perform calculations on it.
4. The `Joining` column can be changed to a date-time data format as it is a date type.
5. Checking from the `messy_data.head()` results we can observe inconsistencies in the formating style of text, dates and numbers in all the column. We can standarrdize and normalize the data to have a well formatted dataset.
6. Since we are having the `ID` column and knowing that it is a unique identifier we should not get any dupliate values.
7. The `Email` column should also have unique entries since no more than one person can own the same email address.

### 1. Understanding Messy Data and the Need for Data Cleaning

### 2. Handling Missing Values, Duplicates, and Outliers

In [38]:
messy_data.columns

Index(['ID', 'Name', 'Age', 'Email', 'Salary ($)', 'Joining Date',
       'Department'],
      dtype='object')

#### Working with missing values (Filling with Mean Value) [Age Column]

In [68]:
messy_data['Age'] = messy_data['Age'].fillna(0)
#messy_data['Age'] = messy_data['Age'].fillna(messy_data['Age'].mean())

for column in messy_data.columns:
    messy_data['Age'] = np.where(messy_data['Age'] == 0, messy_data['Age'].mean(), messy_data['Age'])

In [71]:
messy_data

,ID,Name,Age,Email,Salary ($),Joining Date,Department
0,40,Eve,23.000000,eve@ex.co,65000,02/10/2023,HR
1,26,Alice,31.000000,alice@example.com,"50,000",2022-01-15,HR
2,27,Bob,24.000000,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
3,4,David,22.000000,david@example,50000,2021-07-10,Finance
4,36,Alice,26.000000,alice@example.com,"50,000",2022-01-15,HR
5,2,Bob,20.711111,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
6,5,Eve,27.000000,eve@ex.co,65000,02/10/2023,HR
7,13,Charlie,20.711111,charlie@example.com,60000$,"March 3, 2020",Marketing
8,9,David,23.000000,david@example,50000,2021-07-10,Finance
9,4,David,22.000000,david@example,50000,2021-07-10,Finance
10,7,Bob,29.000000,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
11,25,Eve,23.000000,eve@ex.co,65000,02/10/2023,HR
12,33,Charlie,22.000000,charlie@example.com,60000$,"March 3, 2020",Marketing
13,20,Eve,25.000000,eve@ex.co,65000,02/10/2023,HR
14,18,Charlie,22.000000,charlie@example.com,60000$,"March 3, 2020",Marketing
15,14,David,21.000000,david@example,50000,2021-07-10,Finance
16,3,Charlie,30.000000,charlie@example.com,60000$,"March 3, 2020",Marketing
17,16,Alice,27.000000,alice@example.com,"50,000",2022-01-15,HR
18,10,Eve,31.000000,eve@ex.co,65000,02/10/2023,HR
19,17,Bob,20.711111,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
20,38,Charlie,29.000000,charlie@example.com,60000$,"March 3, 2020",Marketing
21,32,Bob,20.711111,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
22,28,Charlie,28.000000,charlie@example.com,60000$,"March 3, 2020",Marketing
23,1,Alice,25.000000,alice@example.com,"50,000",2022-01-15,HR
24,31,Alice,27.000000,alice@example.com,"50,000",2022-01-15,HR
25,30,Eve,21.000000,eve@ex.co,65000,02/10/2023,HR
26,6,Alice,26.000000,alice@example.com,"50,000",2022-01-15,HR
27,12,Bob,28.000000,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
28,34,David,30.000000,david@example,50000,2021-07-10,Finance
29,2,Bob,20.711111,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
30,1,Alice,25.000000,alice@example.com,"50,000",2022-01-15,HR
31,22,Bob,24.000000,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
32,3,Charlie,30.000000,charlie@example.com,60000$,"March 3, 2020",Marketing
33,35,Eve,25.000000,eve@ex.co,65000,02/10/2023,HR
34,24,David,20.711111,david@example,50000,2021-07-10,Finance
35,37,Bob,24.000000,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
36,11,Alice,24.000000,alice@example.com,"50,000",2022-01-15,HR
37,23,Charlie,29.000000,charlie@example.com,60000$,"March 3, 2020",Marketing
38,19,David,30.000000,david@example,50000,2021-07-10,Finance
39,5,Eve,27.000000,eve@ex.co,65000,02/10/2023,HR
40,21,Alice,26.000000,alice@example.com,"50,000",2022-01-15,HR
41,8,Charlie,20.711111,charlie@example.com,60000$,"March 3, 2020",Marketing
42,15,Eve,26.000000,eve@ex.co,65000,02/10/2023,HR
43,29,David,20.711111,david@example,50000,2021-07-10,Finance
44,39,David,20.711111,david@example,50000,2021-07-10,Finance

In [83]:
#messy_data['Age'] = messy_data['Age'].astype('Int64')
messy_data['Age'] = round(pd.to_numeric(messy_data['Age'], downcast='integer', errors='coerce'), 0) #errors='coerce' will turn non-numeric values to NaN

In [84]:
messy_data['Age'].head(2)

0    23.0
1    31.0
Name: Age, dtype: float32

#### Working with Duplicates and Missing Data [Email Column]

In [85]:
messy_data['Email'] = messy_data['Email'].drop_duplicates()

In [86]:
messy_data = messy_data.dropna()
messy_data

,ID,Name,Age,Email,Salary ($),Joining Date,Department
0,40,Eve,23.0,eve@ex.co,65000,02/10/2023,HR
1,26,Alice,31.0,alice@example.com,"50,000",2022-01-15,HR
2,27,Bob,24.0,BOB@EXAMPLE.COM,55000,15-02-2021,Engineering
3,4,David,22.0,david@example,50000,2021-07-10,Finance
7,13,Charlie,21.0,charlie@example.com,60000$,"March 3, 2020",Marketing

### 3. Data Transformation: Normalization and Standardization

#### Working with the Email Column

In [87]:
messy_data.loc[0, 'Email'] = "eve@example.com"
messy_data.loc[3, 'Email'] = "david@example.com"

In [88]:
messy_data['Email'] = messy_data['Email'].str.lower()
messy_data

C:\Users\CAPACITI-JHB\AppData\Local\Temp\ipykernel_3056\382068256.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  messy_data['Email'] = messy_data['Email'].str.lower()

,ID,Name,Age,Email,Salary ($),Joining Date,Department
0,40,Eve,23.0,eve@example.com,65000,02/10/2023,HR
1,26,Alice,31.0,alice@example.com,"50,000",2022-01-15,HR
2,27,Bob,24.0,bob@example.com,55000,15-02-2021,Engineering
3,4,David,22.0,david@example.com,50000,2021-07-10,Finance
7,13,Charlie,21.0,charlie@example.com,60000$,"March 3, 2020",Marketing

#### Working with the Salary ($) column

In [93]:
messy_data.loc[:, 'Salary ($)'] = messy_data['Salary ($)'].str.strip(',.$')
messy_data.loc[:, 'Salary ($)'] = messy_data['Salary ($)'].str.replace(',', "")

messy_data

,ID,Name,Age,Email,Salary ($),Joining Date,Department
0,40,Eve,23.0,eve@example.com,65000,02/10/2023,HR
1,26,Alice,31.0,alice@example.com,50000,2022-01-15,HR
2,27,Bob,24.0,bob@example.com,55000,15-02-2021,Engineering
3,4,David,22.0,david@example.com,50000,2021-07-10,Finance
7,13,Charlie,21.0,charlie@example.com,60000,"March 3, 2020",Marketing

#### Working with the Joining Date Column

In [106]:
messy_data.loc[:, 'Joining Date'] = messy_data.loc[:,'Joining Date'].str.replace('-', "")

In [ ]:
messy_data.loc[:4, 'Joining Date'] = messy_data.loc[:,'Joining Date'].str.replace('-', "")

In [120]:
messy_data.loc[[0,2], 'Joining Date'] = pd.to_datetime(messy_data.loc[[0,2], 'Joining Date'], format = '%d%m%Y')
messy_data.loc[[1,3], 'Joining Date'] = pd.to_datetime(messy_data.loc[[1,3], 'Joining Date'], format = '%Y%m%d')
messy_data.loc[3, 'Joining Date'] = pd.to_datetime(messy_data.loc[3, 'Joining Date'], format = '%m%d%Y')

In [116]:
messy_data['Joining Date']

0    2023-10-02 00:00:00
1    2022-01-15 00:00:00
2    2021-02-15 00:00:00
3    2021-07-10 00:00:00
7          March 3, 2020
Name: Joining Date, dtype: object

In [121]:
#WORKING THROUGH THE JOINING DATE COLUMN
#df['Joining Date'] = df['Joining Date'].str.replace('-', '')
#df.at[0, 'Joining Date'] = df.at[0, 'Joining Date'].replace('/', '')
 
messy_data.at[0, 'Joining Date'] = pd.to_datetime(messy_data.at[0, 'Joining Date'], format='%d%m%Y').strftime('%d-%m-%Y')
messy_data.at[1, 'Joining Date'] = pd.to_datetime(messy_data.at[1, 'Joining Date'], format='%Y%m%d').strftime('%d-%m-%Y')
messy_data.at[2, 'Joining Date'] = pd.to_datetime(messy_data.at[2, 'Joining Date'], format='%d%m%Y').strftime('%d-%m-%Y')
messy_data.at[3, 'Joining Date'] = pd.to_datetime(messy_data.at[3, 'Joining Date'], format='%Y%m%d').strftime('%d-%m-%Y')
messy_data.at[7, 'Joining Date'] = pd.to_datetime(messy_data.at[7, 'Joining Date'], format='%B %d, %Y').strftime('%d-%m-%Y')

In [124]:
messy_data['Age'] = messy_data['Age'].astype('Int64')

C:\Users\CAPACITI-JHB\AppData\Local\Temp\ipykernel_3056\2490689985.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  messy_data['Age'] = messy_data['Age'].astype('Int64')

In [126]:
messy_data

   ID     Name  Age                Email Salary ($) Joining Date   Department
0  40      Eve   23      eve@example.com      65000   02-10-2023           HR
1  26    Alice   31    alice@example.com      50000   15-01-2022           HR
2  27      Bob   24      bob@example.com      55000   15-02-2021  Engineering
3   4    David   22    david@example.com      50000   10-07-2021      Finance
7  13  Charlie   21  charlie@example.com      60000   03-03-2020    Marketing

In [125]:
cleaned_data = messy_data.to_csv('cleaned_data.csv', index = False)